Revit 2027 API
BuiltInFailures.DirectShapeFailures Class
 Failure definitions related to DirectShapes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DirectShapeFailures
Public NotInheritable Class DirectShapeFailures
public ref class DirectShapeFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DirectShapeFailures = class end
The BuiltInFailures.DirectShapeFailures type exposes the following members.
Properties
Name | Description
CannotCreateDirectShapeOrTypeDocumentCorruption |  Cannot create a DirectShape or DirectShapeType.
CannotCreateDirectShapeOrTypeError |  Cannot create a DirectShape or DirectShapeType.
CannotCreateDirectShapeOrTypeWarning |  Cannot create a DirectShape or DirectShapeType.
CannotCreateDirectShapeRefsWarning |  Cannot create reference objects for a DirectShape.
CannotCreateDirectShapeTypeRefsWarning |  Cannot create reference objects for a DirectShapeType.
Top
See Also
Reference
Autodesk.Revit.DB Namespace